; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	image1 - mode
	infrared0 - mode
	image2 - mode
	Star3 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation5 - direction
	Star2 - direction
	GroundStation4 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(calibration_target instrument0 Star3)
	(supports instrument1 image2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 image2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument7 image2)
	(supports instrument7 image1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation5)
	(supports instrument8 infrared0)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation5)
	(supports instrument9 infrared0)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation4)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite1 Planet10)
	(pointing satellite2 Phenomenon8)
	(have_image Planet6 image2)
	(have_image Star7 image2)
	(have_image Phenomenon8 image1)
	(have_image Planet9 image1)
	(have_image Planet10 infrared0)
))

)

; plan
1. (turn_to satellite2 groundstation4 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation4)
   goals met: 0 of 7
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 7
3. (calibrate satellite2 instrument6 groundstation4)
   added: (calibrated instrument6)
   goals met: 0 of 7
4. (turn_to satellite2 planet9 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet9)
   goals met: 0 of 7
5. (take_image satellite2 planet9 instrument6 image1)
   added: (have_image planet9 image1)
   goals met: 1 of 7
6. (turn_to satellite2 phenomenon8 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon8)
   goals met: 2 of 7
7. (take_image satellite2 phenomenon8 instrument6 image1)
   added: (have_image phenomenon8 image1)
   goals met: 3 of 7
8. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 3 of 7
9. (calibrate satellite1 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 3 of 7
10. (turn_to satellite1 planet6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet6)
   goals met: 3 of 7
11. (take_image satellite1 planet6 instrument4 image2)
   added: (have_image planet6 image2)
   goals met: 4 of 7
12. (turn_to satellite1 star7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star7)
   goals met: 4 of 7
13. (take_image satellite1 star7 instrument4 image2)
   added: (have_image star7 image2)
   goals met: 5 of 7
14. (turn_to satellite1 planet10 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet10)
   goals met: 6 of 7
15. (take_image satellite1 planet10 instrument4 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 7 of 7
